/*Напишите и отладьте программу, печатающую на экране “I want learn C++”.
Мошковская София 26.09.2018*/

#include <iostream>
using namespace std;
int main()
{
	cout << "I want learn C++" << endl;
	cin.get();
}